{
  "intents": [
    {"tag": "stress","patterns": ["I feel stressed","I am overwhelmed","Too much pressure","I can't handle all this work","Life is stressful"],"responses": ["I'm sorry you're feeling stressed. Remember to take deep breaths and small breaks.","Stress can be tough. Try to take a short walk or do something you enjoy.","It's okay to feel stressed sometimes. Would you like some tips to relax?"]},
    {"tag": "sadness","patterns": ["I feel sad","I am feeling low","I am down","Nothing makes me happy","I feel hopeless"],"responses": ["I'm here for you. It's okay to feel sad sometimes.","Would you like to talk about what's making you feel this way?","Remember, sadness is temporary. Small positive steps can help lift your mood"]},
    {"tag": "anxiety","patterns": ["I feel anxious","I am worried all the time","I can't stop worrying","My heart races","I feel nervous for no reason"],"responses": ["It sounds like anxiety is overwhelming you. Try slow, deep breaths to calm yourself.","Anxiety can be intense, but grounding techniques can help. Would you like to try one?","If your anxiety feels unmanageable, consider speaking to a professional. Kiran Helpline: 1800-599-0019"]},
    {"tag": "loneliness","patterns": ["I feel lonely","I have no friends","I am alone all the time","No one understands me","I feel isolated"],"responses": ["You're not alone. I'm here to listen whenever you need.","Connecting with others can help. Is there someone you trust you can talk to?","Remember, even small interactions can ease loneliness. Consider reaching out to a friend or helpline."]},
    {"tag": "burnout","patterns": ["I feel burnt out","I have no energy","I can't focus at work","Everything is exhausting","I feel drained"],"responses": ["Burnout can be serious. Try to rest and prioritize self-care.","It might help to take a short break or delegate some tasks.","Remember, pacing yourself is important. Small steps can help reduce burnout."]},
    {"tag": "self_doubt","patterns": ["I don't think I am good enough","I always fail","I can't do anything right","I am not capable","I lack confidence"],"responses": ["Self-doubt is common, but it doesn't define you.","Focus on small achievements. Each step forward matters.","Remember, you're learning and growing. Be kind to yourself."]},
    {"tag": "relationship_stress","patterns": ["I am having problems with my partner","My relationship is stressful","We keep arguing","I feel misunderstood by my partner","I can't handle the fights"],"responses": ["Relationship stress can be challenging. Communicating openly can help.","Consider expressing your feelings calmly and listening to your partner.","If the stress feels too much, speaking to a counselor can provide support."]},
    {"tag": "hopelessness","patterns": ["I feel hopeless","Nothing matters anymore","I see no way forward","Life feels pointless","I can't cope"],"responses": ["I'm really concerned about you. Please consider reaching out to someone you trust.","You deserve support. Kiran Helpline: 1800-599-0019 is available for confidential help.","Even small steps can help you regain hope. Talking to a professional can guide you through this."]},
    {"tag": "suicidal_ideation","patterns": ["I want to end my life","I feel like dying","I can't go on","Life is too painful","I want to kill myself"],"responses": ["I'm very concerned about your safety. Please contact Kiran Helpline immediately: 1800-599-0019.","You deserve help and support. Reach out to someone you trust or a professional.","It's important to stay safe. If you are in danger, please call the helpline right now."]},
    {"tag": "hope","patterns": ["I feel hopeful","Things will get better","I see a bright future","I am optimistic","I feel positive about life"],"responses": ["It's wonderful that you're feeling hopeful! Keep nurturing that positivity.","Hope is powerful. Remember to celebrate even small victories.","Stay connected to the things and people that give you joy."]},
    {"tag": "gratitude","patterns": ["I feel grateful","I appreciate life","I am thankful for my friends","I notice good things in my life","I feel blessed"],"responses": ["Gratitude can really uplift your mood. Keep noticing the positives!", "That's wonderful! Taking time to appreciate life helps build resilience.", "Sharing gratitude with others can deepen your connections and joy."]},
    {"tag": "mindfulness","patterns": ["I want to meditate","How to be mindful","I want to focus on the present","Mindfulness techniques","I want to calm my mind"],"responses": ["Mindfulness can reduce stress and increase focus. Try focusing on your breath for a few minutes.","Even short mindful exercises can improve your mood.","You can practice mindfulness by observing your thoughts without judgment."]},
    {"tag": "motivation","patterns": ["I feel unmotivated","I can't get started","I don't feel like doing anything","I need energy to work","I am procrastinating"],"responses": ["Motivation can ebb and flow. Start with a small task to build momentum.","Setting small achievable goals can help you regain motivation.","Remember, taking one step at a time is progress."]},
    {"tag": "anger","patterns": ["I am so angry","I can't control my anger","I feel frustrated all the time","I keep losing my temper","I am furious"],"responses": ["Anger is natural. Try taking deep breaths or a short walk to calm down.","Expressing your feelings calmly can prevent conflicts.","If anger feels overwhelming, talking to a professional can help manage it."]},
    {"tag": "sleep_issues","patterns": ["I can't sleep","I am having insomnia","I wake up too early","I feel tired all day","My sleep is restless"],"responses": ["Poor sleep affects mood. Try a relaxing routine before bed.","Avoid screens an hour before sleeping and maintain a consistent sleep schedule.","If sleep issues persist, consider consulting a doctor."]},
    {"tag": "coping_skills","patterns": ["How can I cope with stress","Ways to manage emotions","How to handle anxiety","Tips for difficult times","How to calm down"],"responses": ["Healthy coping strategies include deep breathing, journaling, or talking to someone you trust.","Remember to take breaks and do activities that make you happy.","If coping feels hard, professional guidance can be very supportive."]},
    {"tag": "self_care","patterns": ["I need to take care of myself","Ways to practice self-care","I feel neglected","How to be kind to myself","I need me time"],"responses": ["Self-care is essential. Small daily routines like exercise, healthy meals, and rest can help.","Taking time for yourself is not selfish. It helps you recharge.","Even short moments of self-care can boost your mental well-being."]},
    {"tag": "positive_reinforcement","patterns": ["I did something good","I feel proud of myself","I achieved a goal","I succeeded","I feel accomplished"],"responses": ["That's amazing! Celebrate your achievements, no matter how small.","Your effort matters. Keep recognizing your progress.","Positive reinforcement helps build confidence and motivation."]},
    {"tag": "resilience","patterns": ["I want to be stronger","I want to bounce back","I face challenges easily","How to be resilient","I want to handle difficulties"],"responses": ["Resilience comes from small steps and learning from challenges.","You can build resilience by focusing on solutions and seeking support.","Remember, every challenge you face strengthens you."]},
    {"tag": "self_worth","patterns": ["I feel worthless","I don't deserve happiness","I hate myself","I feel like a failure","I am not enough"],"responses": ["You are valuable and worthy, even if it doesn't feel that way right now.","It's normal to have these thoughts, but remember your efforts and progress matter.","Talking to someone you trust or a professional can help reinforce your self-worth."]},
    {"tag": "overwhelm","patterns": ["Everything is too much","I can't manage","I feel buried under tasks","Too many things happening","I feel lost"],"responses": ["Take one step at a time. Break tasks into smaller pieces to manage better.","It's okay to pause and breathe. Prioritize what is most important right now.","If feeling overwhelmed persists, seeking support can help you regain control."]},
    {"tag": "guilt","patterns": ["I feel guilty","I can't forgive myself","I regret my actions","I feel ashamed","I am responsible for everything"],"responses": ["It's normal to feel guilt, but remember we all make mistakes.","Reflecting and learning from your actions can help you heal.","Consider talking to someone you trust to work through these feelings."]},
    {"tag": "confusion","patterns": ["I feel lost","I don't know what to do","I am unsure about life","I can't make decisions","I feel directionless"],"responses": ["Feeling uncertain is common. Take small steps to clarify your goals.","It's okay to explore options and take your time making decisions.","Talking to someone for guidance can help you find direction."]},
    {"tag": "frustration","patterns": ["I am frustrated","Nothing is going right","I am irritated all the time","I feel stuck","I can't deal with this"],"responses": ["Frustration can be hard. Take a moment to step back and breathe.","Try to identify what you can control and focus on that.","Discussing your frustrations with a trusted person can help lighten the load."]},
    {"tag": "conflict_resolution","patterns": ["I have a fight with my friend","I can't resolve arguments","We keep misunderstanding each other","How to fix conflicts","I feel tension with someone"],"responses": ["Approach the situation calmly and try to understand each other's perspective.","Clear communication and listening can help resolve conflicts.","If conflict persists, consider seeking guidance from a counselor."]},
    {"tag": "work_life_balance","patterns": ["I can't balance work and life","I feel exhausted from work","Too much work stress","I have no time for myself","I am constantly working"],"responses": ["Balancing work and life is important. Set boundaries and allocate time for self-care.","Even small breaks and hobbies can help restore balance.","If work-life balance feels impossible, talking to a mentor or counselor can help."]},
    {"tag": "decision_anxiety","patterns": ["I can't make decisions","I fear choosing wrong","I am anxious about choices","Decision making stresses me","I am indecisive"],"responses": ["Take your time and weigh pros and cons. Small decisions can build confidence.","Trust your instincts and remember that mistakes are part of learning.","Seeking advice from someone you trust can ease decision anxiety."]} ,
    {"tag": "perfectionism","patterns": ["I need everything to be perfect","I can't accept mistakes","I feel stressed if it's not flawless","I am too hard on myself","I can't relax until it's perfect"],"responses": ["Perfectionism can be stressful. Remember, progress is better than perfection.","It's okay to make mistakes. They help you grow.","Try setting realistic goals and celebrating small successes."]},
    {"tag": "fear","patterns": ["I am scared","I feel fearful","I can't face it","I am afraid of the future","I feel anxious about everything"],"responses": ["Fear is natural. Try taking small steps to face what worries you.","Talking about your fears with someone you trust can reduce their intensity.","Remember, courage is not absence of fear, but taking action despite it."]},
    {"tag": "isolation","patterns": ["I feel cut off from everyone","I stay alone all the time","I feel disconnected","No one talks to me","I am isolated"],"responses": ["Connecting with even one person can help reduce isolation.","Consider joining a group or activity where you can meet others.","Reaching out to a helpline or counselor is always an option if you feel alone."]},
    {"tag": "resistance_to_change","patterns": ["I don't want to change","I feel stuck in my habits","I fear new situations","Change scares me","I am resistant to progress"],"responses": ["Change can be uncomfortable but often leads to growth.","Take small steps towards change to make it manageable.","Reflecting on the benefits of change can help reduce fear."]},
    {"tag": "social_anxiety","patterns": ["I feel nervous around people","I avoid social gatherings","I get anxious talking to strangers","I worry about what others think","I am shy and anxious"],"responses": ["Social anxiety is common. Start with small social interactions.","Practice deep breathing or grounding techniques before social events.","A counselor or therapist can provide strategies to manage social anxiety effectively."]},
    {"tag": "greeting","patterns": ["Hi","Hello","Hey","Good morning","Good evening"],"responses": ["Hello! How can I support you today?","Hi there! I'm here to listen.","Hey! How are you feeling today?"]},
    {"tag": "goodbye","patterns": ["Bye","Goodbye","See you later","Talk to you soon"],"responses": ["Goodbye! Take care of yourself.","See you later! Remember, I'm always here if you need to talk.","Bye! Stay positive and safe."]},
    {"tag": "thanks","patterns": ["Thanks","Thank you","I appreciate it","Thanks a lot"],"responses": ["You're welcome!","Anytime! Glad I could help.","No problem! Remember, I'm here whenever you need support."]},
    {"tag": "about","patterns": ["What can you do?","Who are you?","Tell me about yourself","What is this chatbot?"],"responses": ["I am a mental health support chatbot designed to listen and provide guidance.","I can chat with you, provide coping strategies, and connect you to help if needed.","I'm here to support your mental well-being and offer helpful advice."]},
    {"tag": "help","patterns": ["Help","I need help","Can you assist me?","I am confused"],"responses": ["Of course! How can I assist you today?","I'm here to help you through whatever you're feeling.","Tell me more about what you need, and I'll do my best to guide you."]}
 ]
}